app/controllers/patients_controller.rb

  def index
    @patients = Patient.all
---
SELECT * FROM "patients"

  def show
    @patient = Patient.find(params[:id])
---
SELECT * FROM "patients" WHERE ("patients"."id" = 953125641)

  def create
    @patient = Patient.new(params[:patient])
    if @patient.save
---
INSERT INTO "patients" ("address1", "city", "work_phone", "patient_type", "clinic_id", "occupation", "zip", "created_at", "title", "social_security_number", "married", "authorization_on_file", "nickname", "referred_by_id", "work_state", "top_label", "updated_at", "account", "work_status", "work_address1", "send_statement", "inactive", "birth_date", "finance_charge", "cell_phone", "last_visit", "sex", "category_id", "last_name", "phone", "student", "employer", "work_city", "work_comment", "release_info", "first_name", "email", "state", "first_visit", "spouse", "work_zip", "supress_mail") VALUES(NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2009-10-20 11:20:34', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2009-10-20 11:20:34', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)

  def edit
    @patient = Patient.find(params[:id])
---
SELECT * FROM "patients" WHERE ("patients"."id" = 953125641)

  def update
    @patient = Patient.find(params[:id])
---
SELECT * FROM "patients" WHERE ("patients"."id" = 1)