app/controllers/patients_controller.rb

  def update
    @patient = Patient.find(params[:id])
    if @patient.update_attributes(params[:patient])
---
UPDATE "patients" SET "updated_at" = '2009-10-20 08:27:10', "first_visit" = '2005-10-20 00:00:00', "birth_date" = '2011-10-20', "last_visit" = '2006-10-20 00:00:00' WHERE "id" = 1